Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: All expressions with `cdi` and `inject` namespaces are validated during build. For the expression `cdi:personService.findPerson(10).name`, the implementation class of the injected bean must either declare the `findPerson` method or a matching <<template_extension_methods,template extension method>> must exist. For the expression `inject:foo.price`, the implementation class of the injected bean must either have the `price` property (e.g. a `getPrice()` method) or a matching <<template_extension_methods,template extension method>> must exist.
ja_jp: 名前空間 `cdi` と `inject` を含むすべての式は、ビルド時に検証されます。 `cdi:personService.findPerson(10).name` という式では、注入される Bean の実装クラスは `findPerson` メソッドを宣言しているか、マッチする <<template_extension_methods,template extension method>> が存在しなければなりません。 `inject:foo.price` という式では、注入される Bean の実装クラスは `price` プロパティー (例: `getPrice()` メソッド) を持つか、マッチする <<template_extension_methods,template extension method>> が存在しなければなりません。

source: All expressions without a namespace must map to a parameter; e.g. `Hello {foo}` -> the method must have a param of name `foo`
ja_jp: 名前空間を持たないすべての式は、パラメーターにマッピングする必要があります。たとえば、`Hello {foo}` -> の場合、メソッドには `foo` という名前のパラメーターが必要です。

source: All extensions that rely on username/password authentication also allow setting configuration properties in the `application.properties` as an alternative. But the `Credentials Provider` is the only option if credentials are generated (e.g. `Vault Dynamic DB Credentials`) or if a custom credentials provider is required.
ja_jp: ユーザー名/パスワード認証に依存するすべてのエクステンションでは、代替として `application.properties` で設定プロパティーを設定することもできます。しかし、クレデンシャルが生成されている場合 (例: `Vault Dynamic DB Credentials` ) やカスタムのクレデンシャルプロバイダが必要な場合は `Credentials Provider` が唯一のオプションです。

source: All from `ConfigMap`
ja_jp: すべての `ConfigMap` から

source: All from `Secret`
ja_jp: すべての `Secret` から

source: All in all, native image is an excellent option when startup time and footprint are the primary goals.
ja_jp: 全体として、ネイティブイメージは起動時間とフットプリントが主要な目標である場合に優れた選択肢です。

source: All in all, we managed to fix a few more issues in the meantime so that makes 1.10.2.Final a greater release.
ja_jp: その間にいくつかの問題を修正することができたので、1.10.2.Final はより大きなリリースとなりました。

source: All injections via JAX-RS’s @Context are delegated to Arc. This provides users with the benefits of build time injection that Arc brings to all other parts of Quarkus.
ja_jp: JAX-RSの@Contextを介したインジェクションはすべてArcに委譲されます。これにより、ユーザーは、ArcがQuarkusの他のすべての部分にもたらすビルドタイムインジェクションのメリットを得ることができます。

source: All keys must follow this naming convention:
ja_jp: すべてのキーは次の命名規則に従う必要があります。

source: All loaded sources use the same ordinal of the source that found the `quarkus.config.locations` configuration property. For instance, if `quarkus.config.locations` is set as a system property, then all loaded sources have their ordinals set to `400` (system properties use `400` as their ordinal). The ordinal may be overridden directly for each config source by setting the `config_ordinal` property and the ordinal value. The `config_ordinal` property only affects the ordinal of the source in which is being set. Sources are sorted first by their ordinal, then by location order, and finally by loading order.
ja_jp: 読み込まれたすべてのソースは、 `quarkus.config.locations` 設定プロパティーを見つけたソースと同じ序数を使用します。たとえば、 `quarkus.config.locations` がシステムプロパティーとして設定されている場合、ロードされたすべてのソースの序数は `400` に設定されています (システムプロパティーは序数として `400` を使用します)。序数は、 `config_ordinal` と序数値を設定することで、設定ソースごとに直接オーバーライドできます。 `config_ordinal` プロパティーは、設定されているソースの序数にのみ影響します。ソースは、まず序数でソートされ、次に場所の順序、最後に読み込み順序でソートされます。

source: All logs created from the application will include an OpenTelemetry `Resource` indicating the logs were created by the `myservice` application. If not set, it will default to the artifact id.
ja_jp: アプリケーションから作成されたすべてのログには、ログが `myservice` アプリケーションによって作成されたことを示す OpenTelemetry `Resource` が含まれます。設定されていない場合、デフォルトでアーティファクト ID が設定されます。

source: All message bundle templates are validated:
ja_jp: すべてのメッセージバンドルテンプレートは検証されます。

source: All messages received by a consumer must be acknowledged. In the absence of acknowledgment, the processing is considered in error. If the consumer method receives a `Record` or a payload, the message will be acked on method return, also known as `Strategy.POST_PROCESSING`. If the consumer method returns another reactive stream or `CompletionStage`, the message will be acked when the downstream message is acked. You can override the default behavior to ack the message on arrival (`Strategy.PRE_PROCESSING`), or do not ack the message at all (`Strategy.NONE`) on the consumer method as in the following example:
ja_jp: コンシューマーが受信したすべてのメッセージは確認応答する必要があります。確認応答されない場合、処理はエラーと見なされます。コンシューマーメソッドが `Record` またはペイロードを受信した場合、メッセージはメソッドの戻り時に ack されます。これは、 `Strategy.POST_PROCESSING` としても知られています。コンシューマーメソッドが別のリアクティブストリームまたは `CompletionStage` を返す場合、ダウンストリームメッセージが ack されたときにメッセージが ack されます。以下の例のように、デフォルトの動作をオーバーライドして、到着時にメッセージを ack する (`Strategy.PRE_PROCESSING`) か、コンシューマーメソッドでメッセージをまったく ack しない (`Strategy.NONE`) ことができます。

source: All methods accepting a query string also accept an optional `Sort` parameter, which allows you to abstract your sorting:
ja_jp: クエリ文字列を受け付けるすべてのメソッドは、オプションで `Sort` パラメータも受け付けるので、ソートを抽象化することができます。

source: All methods accepting a query string also accept the following simplified query form:
ja_jp: クエリー文字列を受け付けるすべてのメソッドは、以下の簡略化されたクエリー形式も受け付けます:

source: All methods that are annotated with `@Modifying` will automatically be annotated with `@Transactional`.
ja_jp: `@Modified` でアノテーションが付けられたすべてのメソッドには、自動的に `@Transactional` でアノテーションが付けられます。

source: All metrics created from the application will include an OpenTelemetry `Resource` indicating the metrics was created by the `myservice` application. If not set, it will default to the artifact id.
ja_jp: アプリケーションから作成されたすべてのメトリクスには、メトリクスが `myservice` アプリケーションによって作成されたことを示す OpenTelemetry `Resource` が含まれます。 設定されていない場合は、デフォルトでアーティファクト ID になります。

source: All of our tests are run on the same hardware for a given batch. It goes without saying but it's better when you say it.
ja_jp: 私たちのテストはすべて、与えられたバッチに対して同じハードウェアで実行されます。言うまでもないことですが、言うべきことです。

source: All of our tests are run on the same hardware for a given batch. It goes without saying, but it's better when you say it.
ja_jp: すべてのテストは、バッチに対して同じハードウェアで実行しています。言うまでもないことですが、言うべきことです。

source: All of the above can be blocking (POJO) or nonblocking (`@NonBlocking` or `Uni`). Alternatively, data can be streamed using `Multi`.
ja_jp: 上記のすべては、ブロッキング (POJO) または非ブロッキング (`@NonBlocking` または `Uni`) にできます。また、 `Multi` を使用してデータをストリーミングすることもできます。

source: All of the health REST endpoints return a simple JSON object with two fields:
ja_jp: すべてのヘルスRESTエンドポイントは、2つのフィールドを持つシンプルなJSONオブジェクトを返します。

source: All of this information (and more) can be included in your Java code by using appropriate OpenAPI annotations on a JAX-RS `Application` class. Because a JAX-RS `Application` class is not required in Quarkus, you will likely have to create one. It can simply be an empty class that extends `javax.ws.rs.core.Application`. This empty class can then be annotated with various OpenAPI annotations such as `@OpenAPIDefinition`. For example:
ja_jp: JAX-RS `Application` クラスで適切なOpenAPIアノテーションを使用することで、これらの情報（およびそれ以上）をJavaコードに含めることができます。JAX-RS `Application` クラスはQuarkusでは必須ではないため、おそらく作成する必要があるでしょう。 `javax.ws.rs.core.Application` を拡張した空のクラスを作成することができます。この空のクラスは、 `@OpenAPIDefinition` のようなさまざまなOpenAPIアノテーションでアノテーションすることができます。例えば、以下のようになります。

source: All of this information (and more) can be included in your Java code by using appropriate OpenAPI annotations on a Jakarta REST `Application` class. Because a Jakarta REST `Application` class is not required in Quarkus, you will likely have to create one. It can simply be an empty class that extends `jakarta.ws.rs.core.Application`. This empty class can then be annotated with various OpenAPI annotations such as `@OpenAPIDefinition`. For example:
ja_jp: Jakarta REST `Application` クラスで適切な OpenAPI アノテーションを使用することで、これらの情報（や、それ以上）をすべて Java コードに含めることができます。Jakarta REST `Application` クラスは Quarkus では必須ではないため、作成する必要がある場合があります。このクラスは、 `jakarta.ws.rs.core.Application` を拡張した空のクラスとすることができます。この空のクラスには、 `@OpenAPIDefinition` などのさまざまな OpenAPI アノテーションを付けることができます。例えば、次のようになります:

source: All opaque access tokens must be remotely introspected. Sometimes, JWT access tokens might also have to be introspected. If `UserInfo` is also required, the same access token is used in a subsequent remote call to the OIDC provider. So, if `UserInfo` is required, and the current access token is opaque, two remote calls are made for every such token; one remote call to introspect the token and another to get `UserInfo`. If the token is JWT, only a single remote call to get `UserInfo` is needed, unless it also has to be introspected.
ja_jp: 不透明アクセストークンは、すべてリモートでイントロスペクトする必要があります。 場合によっては、JWT アクセストークンをイントロスペクトする必要もあります。 `UserInfo` も必要な場合は、OIDC プロバイダーへの後続のリモート呼び出しで同じアクセストークンが使用されます。 したがって、 `UserInfo` が必要で、現在のアクセストークンが不透明トークンである場合、そのトークンごとに 2 つのリモート呼び出しが行われます。1 つのリモート呼び出しはトークンをイントロスペクトするためのもので、もう 1 つは `UserInfo` を取得するためのものです。 トークンが JWT の場合は、トークンをイントロスペクトする必要がなければ、 `UserInfo` を取得するための 1 つのリモート呼び出しだけで済みます。

source: All opaque and sometimes JWT Bearer access tokens have to be remotely introspected. If `UserInfo` is also required then the same access token will be used to do a remote call to OpenID Connect Provider again. So, if `UserInfo` is required and the current access token is opaque then for every such token there will be 2 remote calls done - one to introspect it and one to get UserInfo with it, and if the token is JWT then usually only a single remote call will be needed - to get UserInfo with it.
ja_jp: すべての不透明な、場合によっては JWT Bearer アクセストークンは、リモートで検査する必要があります。 `UserInfo` も必要な場合は、同じアクセストークンを使用して OpenID Connectプロバイダーへのリモート呼び出しを再度実行します。したがって、 `UserInfo` が必要で、現在のアクセストークンが不透明な場合、そのようなトークンごとに 2 つのリモート呼び出しが行われます。1 つはそれを検査し、もう 1 つは UserInfo を取得します。トークンが JWT の場合、通常は UserInfo を取得するには、1 回のリモート呼び出しだけが必要になります。

source: All other beans can inject such a bean:
ja_jp: 他のすべての Bean は、このような Bean を注入することができます。

source: All other configuration options and APIs are exactly the same as with Elasticsearch.
ja_jp: その他の設定オプションやAPIはElasticsearchの場合と全く同じです。

source: All other user-visible strings in your JS code should also be externalized.
ja_jp: JS コード内の他のすべてのユーザーに表示される文字列も外部化する必要があります。

source: All our tooling has been updated and can now generate Quarkus application with example code (Extension Codestarts) showing the true power of the selected extensions...
ja_jp: すべてのツールが更新され、選択したエクステンションの真の力を示すサンプルコード（Extension Codestarts）とともにQuarkusアプリケーションを生成できるようになりました。

source: All output
ja_jp: すべての出力

source: All parameters of the canonical constructor are injection points. The accessor methods can be used to obtain the injected bean.
ja_jp: 標準コンストラクターのパラメーターはすべて注入ポイントです。アクセサーメソッドを使用して、注入された Bean を取得できます。

source: All paths secured with the authorization using configuration should be tested. Writing path patterns with multiple wildcards can be cumbersome. Please make sure paths are authorized as you intended.
ja_jp: 設定を使用した認可で保護されたすべてのパスをテストする必要があります。 複数のワイルドカードを使用してパスパターンを記述するのは面倒な場合があります。 パスが意図したとおりに認可されていることを確認してください。

source: All possible properties are listed in <<loggingConfigurationReference, the logging configuration reference>>.
ja_jp: 可能なすべてのプロパティーは、 link:#loggingConfigurationReference[ロギング設定リファレンス] に記載されています。

source: All potential properties are listed in the <<loggingConfigurationReference,logging configuration reference>> section.
ja_jp: 考えられるプロパティーはすべて、<<loggingConfigurationReference,logging configuration reference>> セクションにリストします。

source: All potential properties are listed in the xref:loggingConfigurationReference[logging configuration reference] section.
ja_jp: すべての利用可能なプロパティは、 xref:loggingConfigurationReference[ロギング設定参照] セクションに列挙されています。

source: All primitive types and primitive wrapper types
ja_jp: すべてのプリミティブ型とプリミティブラッパー型

source: All regions are bounded by size and time by default. The defaults are `10000` max entries, and `100` seconds as maximum idle time.
ja_jp: すべてのリージョンは、デフォルトではサイズと時間で制限されています。デフォルトでは、最大で `10000` のエントリ数、最大で `100` 秒のアイドル時間が設定されています。

source: All request headers
ja_jp: すべてのリクエストヘッダー

source: All resource methods returning data secured with the `@SecureField` annotation should be tested. Please make sure data are secured as you intended. Quarkus always attempts to detect fields annotated with the `@SecureField` annotation, however it may fail to infer returned type and miss the `@SecureField` annotation instance. If that happens, please explicitly enable secure serialization on the resource endpoint with the `@EnableSecureSerialization` annotation.
ja_jp: `@SecureField` アノテーションで保護されたデータを返すすべてのリソースメソッドはテストする必要があります。 意図したとおりにデータが保護されていることを確認してください。 Quarkus は常に `@SecureField` アノテーションが付与されたフィールドを検出しようとしますが、返される型を推論できず、 `@SecureField` アノテーションのインスタンスを見落とす可能性があります。 その場合は、 `@EnableSecureSerialization` アノテーションをリソースエンドポイントに明示的に適用し、セキュアなシリアライズを有効にしてください。

source: All right, so far so good, but wouldn't it be better with a few tests, just in case.
ja_jp: ここまでは問題ありませんが、念のためにテストを行います。

source: All services based on containers are run using Testcontainers but Quarkus is not using the Testcontainers JDBC driver.
ja_jp: コンテナに基づくサービスはすべてTestcontainersを使用して実行されますが、QuarkusはTestcontainers JDBCドライバを使用していません。

source: All services based on containers are run using Testcontainers but Quarkus is not using the Testcontainers JDBC driver. Thus, even though extra JDBC URL properties can be set in your `application.properties` file, specific properties supported by the Testcontainers JDBC driver such as `TC_INITSCRIPT`, `TC_INITFUNCTION`, `TC_DAEMON`, `TC_TMPFS` are not supported.
ja_jp: コンテナーに基づくすべてのサービスは Testcontainers を使用して実行されますが、Quarkus は Testcontainers JDBC ドライバーを使用しません。そのため、追加の JDBC URL プロパティーを `application.properties` ファイルで設定できますが、 `TC_INITSCRIPT`、 `TC_INITFUNCTION`、 `TC_DAEMON`、 `TC_TMPFS` などの Testcontainers JDBC ドライバーがサポートする特定のプロパティーはサポートされません。

source: All spans created from the application will include an OpenTelemetry `Resource` indicating the span was created by the `myservice` application. If not set, it will default to the artifact id.
ja_jp: このアプリケーションから作成されたすべてのスパンには、そのスパンが `myservice` アプリケーションによって作成されたことを示す OpenTelemetry `Resource` が含まれます。設定されていない場合は、デフォルトでアーティファクトIDが設定されます。

source: All spec classes follow this pattern consistently
ja_jp: すべての仕様クラスは、このパターンを一貫して踏襲しています

source: All telemetry created from the application will include an OpenTelemetry `Resource` attribute indicating the telemetry was created by the `myservice` application. If not set, it will default to the artifact id.
ja_jp: アプリケーションから作成されたすべてのテレメトリには、 `myservice` アプリケーションによって作成されたことを示す OpenTelemetry `Resource` 属性が含まれます。 設定されていない場合、デフォルトでアーティファクト ID が設定されます。

source: All tests should succeed.
ja_jp: すべてのテストは成功するはずです。

source: All that is needed to enable the SmallRye Health features in Quarkus is:
ja_jp: QuarkusでSmallRye Healthの機能を有効にするために必要なことは、以下の通りです:

source: All that is needed to enable the fault tolerance features in Quarkus is:
ja_jp: Quarkusのフォールトトレランス機能を有効にするために必要なのは次の通りです。 :

source: All the IO involved in streaming the SSE results is done in a non-blocking manner.
ja_jp: SSE 結果のストリーミングに関係するすべての IO は、ノンブロッキング方式で実行されます。

source: All the JWT claims can also be injected. Let's expand our `TokenSecuredResource` with another endpoint /secured/roles-allowed-admin which uses the injected `birthdate` claim (as opposed to getting it from `JsonWebToken`):
ja_jp: すべての JWT クレームを挿入することもできます。 `TokenSecuredResource` を別のエンドポイント /secured/roles-allowed-admin で拡張してみましょう。これは、(`JsonWebToken` から取得するのではなく) 挿入された `birthdate` クレームを使用します。

source: All the JWT claims can also be injected. Let's expand our `TokenSecuredResource` with another endpoint `/secured/roles-allowed-admin` which uses the injected `birthdate` claim (as opposed to getting it from `JsonWebToken`):
ja_jp: すべての JWT クレームを挿入することもできます。 (`JsonWebToken` から取得するのではなく) `TokenSecuredResource` を、挿入された `birthdate` クレームを使用する別のエンドポイント `/secured/roles-allowed-admin` で継承してみましょう。

source: All the OpenTelemetry properties and their defaults can be found in the xref:opentelemetry.adoc#configuration-reference[OpenTelemetry configuration reference].
ja_jp: すべての OpenTelemetry プロパティーとそのデフォルトについては、xref:opentelemetry.adoc#configuration-reference[OpenTelemetry 設定リファレンス] を参照してください。

source: All the SmallRye components in Quarkus have been updated to the latest and greatest and, apart from implementing MicroProfile 4, they also come with additional new features.
ja_jp: QuarkusのSmallRyeコンポーネントはすべて最新のものにアップデートされており、MicroProfile 4を実装しているだけでなく、追加の新機能も搭載されています。

source: All the `<annotation>` and `<member>` parts are changed from camel case (`BeforeRetry`, `methodName`) to kebab case (`before-retry`, `method-name`). Two annotation members are special cased to improve consistency:
ja_jp: すべての `<annotation> ` および `<member> ` の部分は、キャメルケース (`BeforeRetry`、`methodName`) からケバブケース (`before-retry`、`method-name`) に変更されます。 一貫性を向上させるために、2 つのアノテーションメンバーが特別に処理されます。

source: All the alternative entity operations are available from these methods:
ja_jp: 代替のエンティティー操作はすべて、これらのメソッドから利用できます。

source: All the capabilities found in an application will be aggregated during the build in an instance of `io.quarkus.deployment.Capabilities` build item, which can be injected by extension build steps to check whether a certain capability is present or not. E.g.
ja_jp: アプリケーションで見つかったすべてのケイパビリティは、ビルド中に `io.quarkus.deployment.Capabilities` ビルドアイテムのインスタンスに集約されます。このアイテムは、エクステンションビルドステップによって注入され、特定のケイパビリティが存在するかどうかをチェックすることができます。例えば、以下のようになります。

source: All the classes in the `org.acme.somemodel` package and its subpackages
ja_jp: `org.acme.somemodel` パッケージとそのサブパッケージ内のすべてのクラス

source: All the config options are shown below:
ja_jp: すべての設定項目を以下に示します。

source: All the configurations from the OpenTelemetry and Micrometer extensions are available with `quarkus-micrometer-opentelemetry`.
ja_jp: OpenTelemetry および Micrometer エクステンションのすべての設定は、`quarkus-micrometer-opentelemetry` で利用できます。

source: All the contexts that are not explicitly listed in other sets
ja_jp: 他のセットに明示されていないすべてのコンテキスト

source: All the developers are finding Quarkus easier to pick up, even the Python and .NET developers, and embracing it:
ja_jp: すべての開発者は、Pythonや.NETの開発者も含めて、Quarkusを簡単に使いこなせるようになり、受け入れています:

source: All the guides are now promoting RESTEasy Reactive and should be consistent in the naming: for your traditional RESTEasy, look for RESTEasy Classic, for the new layer, look for RESTEasy Reactive.
ja_jp: すべてのガイドがRESTEasy Reactiveを推進しており、ネーミングを統一する必要があります。従来のRESTEasyはRESTEasy Classic、新しいレイヤーはRESTEasy Reactiveとします。

source: All the https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[OIDC Client Authentication] options are supported, for example:
ja_jp: すべての https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[OIDC Client Authentication] オプションがサポートされています。次に例を示します。

source: All the information between the browser and the server are formatted as JSON.
ja_jp: ブラウザとサーバー間の情報はすべて JSON 形式になっています。

source: All the information between the browser and the server is formatted as JSON.
ja_jp: ブラウザとサーバー間の情報はすべてJSON形式になっています。

source: All the information retrieved from these diverse sources is then fed into an <strong>Aggregator/Reranker</strong>. This component combines and prioritizes the retrieved content based on relevance to the original query.
ja_jp: これらの多様なソースから検索されたすべての情報は、その後、<strong>アグリゲーター/再ランク付け器</strong>に供給されます。このコンポーネントは、元のクエリへの関連性に基づいて、検索されたコンテンツを結合し、優先順位を付けます。

source: All the logging configuration will then be done inside your `application.properties`.
ja_jp: すべてのロギング設定は、 `application.properties` の中で実施されます。

source: All the model classes under the `org.acme.model.shared` and `org.acme.model.user` packages will be attached to the `users` persistence unit.
ja_jp: `org.acme.model.shared` と `org.acme.model.user` パッケージの下にあるすべてのモデル・クラスは、 `users` 永続化ユニットにアタッチされます。

source: All the operations return a `Uni<T>` instead of `T`, which is the standard Mutiny reactive type
ja_jp: すべての操作は、`T` の代わりに `Uni<T>` を返します。これは標準的な Mutiny リアクティブ型です。

source: All the operations that are defined on `PanacheEntityBase` are available on your repository, so using it is exactly the same as using the active record pattern, except you need to inject it:
ja_jp: `PanacheEntityBase` で定義されている操作はすべてリポジトリ上で利用可能なので、これを使用することはアクティブレコードパターンを使用するのと全く同じですが、それを注入する必要があります。

source: All the operations that are defined on `PanacheMongoEntityBase` are available on your repository, so using it is exactly the same as using the active record pattern, except you need to inject it:
ja_jp: `PanacheMongoEntityBase` で定義されているすべての操作は、あなたのリポジトリで利用できます。そのため、これを使用することは、注入する必要があることを除けば、active record パターンを使用することとまったく同じです。

source: All the other Swagger UI options are now available to configure the UI.
ja_jp: 他のSwagger UIオプションはすべてUIの設定が可能になりました。

source: All the other optimizations equally benefit Gradle builds, but the following change is specific to Maven as it relates to the Maven default lifecycle.
ja_jp: 他のすべての最適化はGradleビルドにも同様にメリットをもたらしますが、以下の変更はMavenのデフォルトライフサイクルに関連するため、Mavenに固有のものです。

source: All the properties within the `kafka-streams` namespace are passed through as-is to the Kafka Streams engine. Changing their values requires a rebuild of the application.
ja_jp: `kafka-streams` ネームスペース内のすべてのプロパティーは、そのまま Kafka Streams エンジンに渡されます。プロパティーの値を変更するには、アプリケーションの再構築が必要です。

source: All the registries listed in the configuration file are enabled by default. A registry can be disabled though by adding `enabled: false` to its configuration. For example:
ja_jp: 設定ファイルに記載されているすべてのレジストリは、デフォルトで有効になっています。その設定に `enabled: false` を追加することで、レジストリを無効にすることができます。例えば、以下のようになります:

source: All the repositories you define as nested interfaces of your entity will be available under their generated metamodel class under accessor methods of the same name as the repository. This is strictly equivalent to injecting the repository type, and in fact uses CDI under the hood to look up the repository.
ja_jp: エンティティのネストされたインターフェースとして定義するすべてのリポジトリは、生成されたメタモデルクラスの、リポジトリと同じ名前のアクセサーメソッドの下で利用できます。これはリポジトリ型をインジェクトすることと厳密に同等であり、実際には内部で CDI を使用してリポジトリを検索します。

source: All the request headers
ja_jp: すべてのリクエストヘッダー

source: All the source code for the examples below is https://github.com/phillip-kruger/openapi-example[available here].
ja_jp: 以下の例のすべてのソースコードは、 https://github.com/phillip-kruger/openapi-example[ここ]にあります。

source: All the static and dynamic tenant resolution options listed in the <<static-tenant-resolution>> and <<tenant-config-resolver>> sections can be used to resolve a tenant.
ja_jp: <<static-tenant-resolution>> と <<tenant-config-resolver>> セクションに記載されているすべての静的および動的テナント解決オプションを使用して、テナントを解決できます。

source: All the static and dynamic tenant resolution options listed in the <<static-tenant-resolution>> and <<tenant-config-resolver>> sections can be used to resolve a tenant. Before the tenant resolution begins, the authorization code flow `state cookie` is used to set the already resolved tenant configuration id as a RoutingContext `tenant-id` attribute: both custom dynamic `TenantConfigResolver` and static `TenantResolver` tenant resolvers can check it.
ja_jp: 静的および動的テナント解決オプションはすべて、<<static-tenant-resolution>> に記載されています。また、<<tenant-config-resolver>> セクションを使用して、テナントを解決できます。テナント解決が始まる前に、認可コードフローの `state cookie` を使用して、すでに解決されたテナント設定 ID を RoutingContext の `tenant-id` 属性として設定します。カスタムの動的 `TenantConfigResolver` テナントリゾルバーと静的 `TenantResolver` テナントリゾルバーの両方でこれを確認できます。
